def power(a, n): #визначаємо функцію
    if n == 0: # конструкція іf-else, котра підносить число в степені
        return 1 #повертаємо одиницю 
    elif n % 2 == 1: 
        return power(a, n - 1) * a #повертаємо результат 
    else: 
        return power(a, n // 2) ** 2 #повертаємо результат 
        
a = float(input("Будь ласка введіть числo a ")) #вводимо значення a, a > 0 
n = int(input("Будь ласка введіть числo n ")) #вводимо значення n, n > 0 	
print(power(a,n)) #викликаємо функцію та виводимо резульатат, що вона повертає         