def distance(x1, y1, x2, y2):  #визначаємо функцію
	result = ((x2-x1)**2+(y2-y1)**2)**0.5 #рахуємо відстань між точками 
	return result #повертаэмо результат 

x1 = float(input("Будь ласка введіть число х1 ")) #вводимо значення координат
x2 = float(input("Будь ласка введіть число y1 ")) #вводимо значення координат
y1 = float(input("Будь ласка введіть число x2 ")) #вводимо значення координат
y2 = float(input("Будь ласка введіть число у2 ")) #вводимо значення координат
print(distance(x1,y1,x2,y2)) #викликаємо функцію та виводимо резульатат, що вона повертає 